results/out/httpkit.ring-middleware.async.java17.ParallelGC.r50k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 39.630ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 39.537ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9.950ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 14.119ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 39.617ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9.866ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9.884ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9.912ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9.887ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 39.541ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.457ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9.800ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9.900ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 39.672ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 39.612ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 40.354ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.68ms    2.36ms  43.84ms   97.41%
    Req/Sec     3.30k   572.30    13.33k    70.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.30ms
 75.000%    1.90ms
 90.000%    2.44ms
 99.000%   16.06ms
 99.900%   25.79ms
 99.990%   31.18ms
 99.999%   36.90ms
100.000%   43.87ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.057     0.000000            2         1.00
       0.491     0.100000      2955937         1.11
       0.717     0.200000      5908371         1.25
       0.917     0.300000      8848663         1.43
       1.108     0.400000     11808950         1.67
       1.301     0.500000     14751206         2.00
       1.406     0.550000     16227852         2.22
       1.518     0.600000     17703268         2.50
       1.636     0.650000     19171026         2.86
       1.764     0.700000     20653241         3.33
       1.901     0.750000     22126514         4.00
       1.974     0.775000     22859247         4.44
       2.053     0.800000     23610481         5.00
       2.135     0.825000     24348932         5.71
       2.223     0.850000     25084177         6.67
       2.321     0.875000     25818323         8.00
       2.375     0.887500     26177793         8.89
       2.437     0.900000     26546322        10.00
       2.509     0.912500     26914582        11.43
       2.597     0.925000     27287234        13.33
       2.711     0.937500     27654586        16.00
       2.785     0.943750     27836863        17.78
       2.879     0.950000     28020167        20.00
       3.003     0.956250     28205230        22.86
       3.177     0.962500     28388298        26.67
       3.453     0.968750     28572195        32.00
       3.713     0.971875     28664548        35.56
       4.251     0.975000     28756466        40.00
       5.671     0.978125     28848545        45.71
       7.975     0.981250     28940743        53.33
      10.695     0.984375     29033025        64.00
      12.119     0.985938     29079101        71.11
      13.607     0.987500     29125043        80.00
      15.151     0.989062     29171289        91.43
      16.655     0.990625     29217201       106.67
      18.127     0.992188     29263413       128.00
      18.847     0.992969     29286729       142.22
      19.535     0.993750     29309505       160.00
      20.239     0.994531     29332709       182.86
      20.927     0.995313     29355466       213.33
      21.679     0.996094     29378700       256.00
      22.079     0.996484     29390209       284.44
      22.495     0.996875     29401684       320.00
      22.943     0.997266     29413168       365.71
      23.439     0.997656     29424624       426.67
      23.999     0.998047     29436406       512.00
      24.287     0.998242     29441977       568.89
      24.623     0.998437     29447672       640.00
      24.991     0.998633     29453382       731.43
      25.407     0.998828     29459319       853.33
      25.855     0.999023     29465064      1024.00
      26.095     0.999121     29467838      1137.78
      26.351     0.999219     29470678      1280.00
      26.655     0.999316     29473690      1462.86
      26.991     0.999414     29476513      1706.67
      27.375     0.999512     29479343      2048.00
      27.599     0.999561     29480767      2275.56
      27.855     0.999609     29482238      2560.00
      28.127     0.999658     29483699      2925.71
      28.447     0.999707     29485084      3413.33
      28.863     0.999756     29486537      4096.00
      29.103     0.999780     29487260      4551.11
      29.391     0.999805     29487963      5120.00
      29.711     0.999829     29488673      5851.43
      30.127     0.999854     29489412      6826.67
      30.607     0.999878     29490102      8192.00
      30.895     0.999890     29490466      9102.22
      31.263     0.999902     29490830     10240.00
      31.695     0.999915     29491186     11702.86
      32.175     0.999927     29491546     13653.33
      32.735     0.999939     29491909     16384.00
      33.023     0.999945     29492091     18204.44
      33.343     0.999951     29492263     20480.00
      33.663     0.999957     29492443     23405.71
      34.047     0.999963     29492629     27306.67
      34.463     0.999969     29492808     32768.00
      34.751     0.999973     29492900     36408.89
      35.007     0.999976     29492984     40960.00
      35.327     0.999979     29493072     46811.43
      35.711     0.999982     29493162     54613.33
      36.191     0.999985     29493252     65536.00
      36.447     0.999986     29493303     72817.78
      36.607     0.999988     29493344     81920.00
      36.831     0.999989     29493393     93622.86
      37.055     0.999991     29493433    109226.67
      37.375     0.999992     29493483    131072.00
      37.503     0.999993     29493502    145635.56
      37.631     0.999994     29493522    163840.00
      37.791     0.999995     29493549    187245.71
      37.983     0.999995     29493568    218453.33
      38.271     0.999996     29493593    262144.00
      38.367     0.999997     29493603    291271.11
      38.495     0.999997     29493614    327680.00
      38.751     0.999997     29493625    374491.43
      38.911     0.999998     29493635    436906.67
      39.103     0.999998     29493646    524288.00
      39.167     0.999998     29493652    582542.22
      39.263     0.999998     29493657    655360.00
      39.391     0.999999     29493663    748982.86
      39.871     0.999999     29493671    873813.33
      39.903     0.999999     29493674   1048576.00
      39.935     0.999999     29493677   1165084.44
      40.031     0.999999     29493680   1310720.00
      40.479     0.999999     29493683   1497965.71
      40.575     0.999999     29493686   1747626.67
      40.607     1.000000     29493689   2097152.00
      40.671     1.000000     29493690   2330168.89
      40.703     1.000000     29493691   2621440.00
      40.959     1.000000     29493693   2995931.43
      41.311     1.000000     29493694   3495253.33
      41.343     1.000000     29493695   4194304.00
      41.663     1.000000     29493696   4660337.78
      42.143     1.000000     29493697   5242880.00
      42.431     1.000000     29493698   5991862.86
      42.431     1.000000     29493698   6990506.67
      42.559     1.000000     29493699   8388608.00
      42.559     1.000000     29493699   9320675.55
      43.807     1.000000     29493700  10485760.00
      43.807     1.000000     29493700  11983725.71
      43.807     1.000000     29493700  13981013.34
      43.839     1.000000     29493701  16777216.00
      43.839     1.000000     29493701  18641351.10
      43.839     1.000000     29493701  20971519.98
      43.839     1.000000     29493701  23967451.45
      43.839     1.000000     29493701  27962026.68
      43.871     1.000000     29493702  33554432.00
      43.871     1.000000     29493702          inf
#[Mean    =        1.679, StdDeviation   =        2.361]
#[Max     =       43.840, Total count    =     29493702]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29993613 requests in 10.00m, 4.25GB read
Requests/sec:  49989.40
Transfer/sec:      7.25MB