results/out/jetty.ring-interceptors.async.java11.ZGC.r60k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 655.891ms, rate sampling interval: 3274ms
  Thread calibration: mean lat.: 476.156ms, rate sampling interval: 2293ms
  Thread calibration: mean lat.: 680.465ms, rate sampling interval: 3155ms
  Thread calibration: mean lat.: 582.003ms, rate sampling interval: 3063ms
  Thread calibration: mean lat.: 530.385ms, rate sampling interval: 2832ms
  Thread calibration: mean lat.: 473.406ms, rate sampling interval: 2660ms
  Thread calibration: mean lat.: 948.221ms, rate sampling interval: 4390ms
  Thread calibration: mean lat.: 690.394ms, rate sampling interval: 3446ms
  Thread calibration: mean lat.: 411.015ms, rate sampling interval: 2055ms
  Thread calibration: mean lat.: 1119.975ms, rate sampling interval: 5828ms
  Thread calibration: mean lat.: 620.902ms, rate sampling interval: 3039ms
  Thread calibration: mean lat.: 574.242ms, rate sampling interval: 2832ms
  Thread calibration: mean lat.: 371.685ms, rate sampling interval: 1919ms
  Thread calibration: mean lat.: 769.586ms, rate sampling interval: 3579ms
  Thread calibration: mean lat.: 828.992ms, rate sampling interval: 4284ms
  Thread calibration: mean lat.: 577.614ms, rate sampling interval: 3313ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.77s    39.54s    4.05m    84.54%
    Req/Sec     3.34k   426.05     4.81k    67.93%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.93s 
 75.000%   44.30s 
 90.000%    1.48m 
 99.000%    2.71m 
 99.900%    3.47m 
 99.990%    3.81m 
 99.999%    4.05m 
100.000%    4.06m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.108     0.000000            2         1.00
     377.343     0.100000      3147623         1.11
    1121.279     0.200000      6296140         1.25
    2572.287     0.300000      9441123         1.43
    5439.487     0.400000     12591118         1.67
   10928.127     0.500000     15737634         2.00
   15196.159     0.550000     17309158         2.22
   21200.895     0.600000     18883427         2.50
   27738.111     0.650000     20456010         2.86
   35323.903     0.700000     22033794         3.33
   44302.335     0.750000     23603359         4.00
   49545.215     0.775000     24390262         4.44
   55672.831     0.800000     25176644         5.00
   62881.791     0.825000     25964396         5.71
   70844.415     0.850000     26754966         6.67
   79233.023     0.875000     27536382         8.00
   83558.399     0.887500     27934666         8.89
   88866.815     0.900000     28324808        10.00
   95092.735     0.912500     28718345        11.43
  101449.727     0.925000     29111108        13.33
  108724.223     0.937500     29503744        16.00
  112787.455     0.943750     29702966        17.78
  116981.759     0.950000     29897378        20.00
  122028.031     0.956250     30094809        22.86
  128057.343     0.962500     30290283        26.67
  134610.943     0.968750     30488718        32.00
  137887.743     0.971875     30584969        35.56
  141295.615     0.975000     30686225        40.00
  145096.703     0.978125     30781419        45.71
  148766.719     0.981250     30879997        53.33
  152698.879     0.984375     30981228        64.00
  155058.175     0.985938     31029034        71.11
  157548.543     0.987500     31077694        80.00
  160563.199     0.989062     31126636        91.43
  164626.431     0.990625     31174725       106.67
  169869.311     0.992188     31224400       128.00
  172883.967     0.992969     31249353       142.22
  176029.695     0.993750     31273745       160.00
  179437.567     0.994531     31298301       182.86
  182845.439     0.995313     31323038       213.33
  185860.095     0.996094     31347035       256.00
  187564.031     0.996484     31359679       284.44
  189530.111     0.996875     31371827       320.00
  191496.191     0.997266     31384464       365.71
  193724.415     0.997656     31396444       426.67
  196476.927     0.998047     31408688       512.00
  198180.863     0.998242     31414747       568.89
  201195.519     0.998437     31420660       640.00
  203685.887     0.998633     31426842       731.43
  206438.399     0.998828     31433070       853.33
  208666.623     0.999023     31439093      1024.00
  209977.343     0.999121     31442263      1137.78
  211025.919     0.999219     31445466      1280.00
  212205.567     0.999316     31448247      1462.86
  213778.431     0.999414     31451365      1706.67
  215482.367     0.999512     31454540      2048.00
  216530.943     0.999561     31455976      2275.56
  217448.447     0.999609     31457553      2560.00
  218234.879     0.999658     31459053      2925.71
  219283.455     0.999707     31460624      3413.33
  220200.959     0.999756     31462046      4096.00
  220856.319     0.999780     31462816      4551.11
  223346.687     0.999805     31463576      5120.00
  224788.479     0.999829     31464367      5851.43
  226230.271     0.999854     31465182      6826.67
  227409.919     0.999878     31465941      8192.00
  228065.279     0.999890     31466260      9102.22
  228851.711     0.999902     31466645     10240.00
  230424.575     0.999915     31467029     11702.86
  231604.223     0.999927     31467455     13653.33
  232259.583     0.999939     31467799     16384.00
  232652.799     0.999945     31467989     18204.44
  233046.015     0.999951     31468185     20480.00
  234225.663     0.999957     31468386     23405.71
  236060.671     0.999963     31468574     27306.67
  238157.823     0.999969     31468770     32768.00
  238944.255     0.999973     31468853     36408.89
  239861.759     0.999976     31468953     40960.00
  240517.119     0.999979     31469058     46811.43
  241172.479     0.999982     31469150     54613.33
  241565.695     0.999985     31469247     65536.00
  242089.983     0.999986     31469302     72817.78
  242352.127     0.999988     31469351     81920.00
  242745.343     0.999989     31469385     93622.86
  243007.487     0.999991     31469494    109226.67
  243007.487     0.999992     31469494    131072.00
  243138.559     0.999993     31469545    145635.56
  243138.559     0.999994     31469545    163840.00
  243269.631     0.999995     31469650    187245.71
  243269.631     0.999995     31469650    218453.33
  243269.631     0.999996     31469650    262144.00
  243269.631     0.999997     31469650    291271.11
  243269.631     0.999997     31469650    327680.00
  243269.631     0.999997     31469650    374491.43
  243269.631     0.999998     31469650    436906.67
  243400.703     0.999998     31469717    524288.00
  243400.703     1.000000     31469717          inf
#[Mean    =    29766.389, StdDeviation   =    39543.661]
#[Max     =   243269.632, Total count    =     31469717]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  32000577 requests in 10.00m, 4.95GB read
Requests/sec:  53334.39
Transfer/sec:      8.44MB